---
kind: other
id: Properties.T:Autodesk.Revit.DB.SkyBackgroundSettings
source: html/9f453476-f632-c216-7209-e0d2b87e0bff.htm
---
# SkyBackgroundSettings Properties

Specifies whether the .NET object represents a valid Revit entity.